#include <iostream>
#include <fstream>

void f()
{
    std::cout <<
"                $$$$\n              $$    $$\n              $$    $$\n              $$    $$\n              $$    $$\n              $$    $$\n          $$$$$$    $$$$$$\n        $$    $$    $$    $$$$s\n        $$    $$    $$    $$  $$\n$$$$$$  $$    $$    $$    $$    $$\n$$    $$$$                $$    $$\n$$      $$                      $$\n  $$    $$                      $$\n   $$$  $$                      $$\n    $$        Хуй тобі          $$\n     $$$         а не масив    $$\n      $$                      $$$\n       $$$                    $$\n        $$                   $$\n         $$$                $$$\n         $$                $$\n         $$$$$$$$$$$$$$$$$$$$" << std::endl;
}

int main()
{
    f();

    return 0;
}